In [1]:
#create a database
import mysql.connector #importing database

database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="python-class"
)

db = database.cursor()

In [2]:
db.execute("SELECT * FROM student") #'*'= all
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram ', 99, 80, 67, 55, 65, 311.0, 62.2, 'C')
(2, 'Shyam', 80, 80, 80, 80, 80, 400.0, 80.0, 'A')
(3, 'Hari', 90, 60, 0, 50, 90, 290.0, 58.0, 'B')
(4, 'Madam', 87, 65, 98, 78, 22, 300.0, 75.0, 'B')
(5, 'Padam', 37, 25, 99, 48, 62, 278.0, 70.0, 'B')
(6, 'Padma', 87, 15, 49, 48, 82, 288.0, 73.0, 'B')
(7, 'Alex', 40, 40, 20, 40, 40, 180.0, 35.0, 'D')
(8, 'Nabin', 40, 40, 80, 40, 40, 230.0, 50.0, 'C')
(9, 'Rohan', 0, 0, 0, 0, 0, 0.0, 0.0, 'U')
(10, 'Rohit', 90, 90, 90, 90, 99, 459.0, 93.0, 'A')
(11, 'Ramesh', 88, 96, 56, 63, 55, 300.0, 75.0, 'B')
(12, 'Buvam', 88, 96, 56, 63, 55, 300.0, 75.0, 'B')
(13, 'Ganesh', 98, 96, 96, 83, 87, 400.0, 94.0, 'A')

In [3]:
db.execute("SELECT sn,name,total,grade FROM student") #'*'= all
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram ', 311.0, 'C')
(2, 'Shyam', 400.0, 'A')
(3, 'Hari', 290.0, 'B')
(4, 'Madam', 300.0, 'B')
(5, 'Padam', 278.0, 'B')
(6, 'Padma', 288.0, 'B')
(7, 'Alex', 180.0, 'D')
(8, 'Nabin', 230.0, 'C')
(9, 'Rohan', 0.0, 'U')
(10, 'Rohit', 459.0, 'A')
(11, 'Ramesh', 300.0, 'B')
(12, 'Buvam', 300.0, 'B')
(13, 'Ganesh', 400.0, 'A')

In [4]:
db.execute("SELECT * FROM student WHERE grade='A' and percentage > 80") #'*'= all
result =db.fetchall()
for x in result:
    print(x)

(10, 'Rohit', 90, 90, 90, 90, 99, 459.0, 93.0, 'A')
(13, 'Ganesh', 98, 96, 96, 83, 87, 400.0, 94.0, 'A')

In [5]:
db.execute("SELECT * FROM student WHERE name='Ram'") #'*'= all
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram ', 99, 80, 67, 55, 65, 311.0, 62.2, 'C')

In [6]:
#Insert
sql='''INSERT INTO student ( Name,Physics,Chemistry,Mathematics,English,Nepali,Total,Percentage,Grade) VALUES ('Ramesh', 88, 96, 56, 63, 55, 300, 75, 'B')'''
db.execute(sql)
database.commit()

In [7]:
#Insert
sql='''INSERT INTO student ( Name,Physics,Chemistry,Mathematics,English,Nepali,Total,Percentage,Grade) VALUES ('Ganesh', 98, 96, 96, 83, 87, 400, 94, 'A')'''
db.execute(sql)
database.commit()

In [14]:
#Insert
n=int(input('Enter no. of data entry'))
for i in range(n):
    name=input('Enter Name= ').capitalize()
    math=float(input('Enter marks of Math= '))
    p=float(input('Enter Marks of Physics= '))
    c=float(input('Enter Marks of Chemistry= '))
    e=float(input('Enter Marks of English= '))
    n=float(input('Enter Marks of Nepali= '))
    total=math+p+c+e+n
    P=((math+p+c+e+n)/500)*100

    if  p>=90:
        Grade = 'A+'
    elif 80<=p<90:
        Grade = 'A'
    elif 70<=p<80:
        Grade='B+'
    elif 60<=p<70:
        Grade='B'
    elif 50<=p<60:
        Grade='C+'
    elif 40<=p<50:
        Grade='C'
    else:
        Grade='F'

    sql=f'''INSERT INTO student ( Name,Physics,Chemistry,Mathematics,English,Nepali,Total,Percentage,Grade) VALUES ('{name}', {p}, {c},{math}, {e}, {n},{total},{p}, '{Grade}')'''
    db.execute(sql)
database.commit()

Enter no. of data entry1
Enter Name= rohan
Enter marks of Math= 0
Enter Marks of Physics= 0
Enter Marks of Chemistry= 0
Enter Marks of English= 0
Enter Marks of Nepali= 0

In [18]:
#Updating
name=input('Enter Name= ')
sn=int(input('Enter SN= '))
sql=f"UPDATE student SET Name = '{name}' WHERE sn = {sn}"
db.execute(sql)
database.commit()

Enter Name= Birendra
Enter SN= 20

In [19]:
#Delete
sql = "DELETE FROM student WHERE sn=20 "
db.execute(sql)
database.commit()